smitamw/esp32s3-assistant/ai_assistant_esp32s3/ai_assistant_esp32s3.ino
#include <Arduino.h>
#include <HTTPClient.h>
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <driver/i2s.h>
#include <esp_heap_caps.h>
#include <esp_idf_version.h>
#include <esp_intr_alloc.h>
#include <mbedtls/base64.h>

constexpr char WIFI_SSID[] = "Zapisco";
constexpr char WIFI_PASSWORD[] = "Zapisco2020@757!";
constexpr char GEMINI_API_KEY[] = "AIzaSyDwf5F52Zz_CLpWTrTQ_U9CJvhRyOjkGjs";
constexpr char GEMINI_TEXT_MODEL[] = "gemini-3-flash-preview";
constexpr char GEMINI_TTS_MODEL[] = "gemini-2.5-flash-preview-tts";
constexpr char GEMINI_TTS_VOICE[] = "Kore";

constexpr int SPEAKER_I2S_LRCLK_PIN = 45;  // MAX98357A LRC.
constexpr int SPEAKER_I2S_BCLK_PIN = 48;   // MAX98357A BCLK.
constexpr int SPEAKER_I2S_DOUT_PIN = 47;   // MAX98357A DIN.
constexpr int MIC_I2S_WS_PIN = 4;          // Mic WS.
constexpr int MIC_I2S_SCK_PIN = 5;         // Mic SCK.
constexpr int MIC_I2S_DIN_PIN = 6;         // Mic SD.
constexpr int AMP_SD_PIN = 9;

constexpr int BUTTON_GROUND_PIN = 7;
constexpr int BUTTON_INPUT_PIN = 15;

constexpr int NEOPIXEL_PIN = 48;
constexpr uint8_t NEOPIXEL_BRIGHTNESS = 32;

constexpr uint32_t AUDIO_SAMPLE_RATE = 11025;
constexpr uint32_t TTS_SAMPLE_RATE = 24000;
constexpr uint8_t MAX_RECORDING_SECONDS = 5;
constexpr size_t MAX_RECORDING_SAMPLES =
    AUDIO_SAMPLE_RATE * MAX_RECORDING_SECONDS;
constexpr size_t MONO_SAMPLES_PER_CHUNK = 512;
constexpr uint32_t BUTTON_DEBOUNCE_MS = 35;
constexpr uint8_t PLAYBACK_GAIN = 1;
constexpr bool PLAY_TEST_TONE_ON_BOOT = true;
constexpr uint16_t TEST_TONE_HZ = 660;
constexpr uint16_t TEST_TONE_MS = 250;
constexpr int16_t TEST_TONE_AMPLITUDE = 12000;
constexpr uint8_t MIC_SAMPLE_SHIFT = 16;
constexpr bool PRINT_MIC_RAW_DEBUG = true;
constexpr uint32_t MIC_DEBUG_INTERVAL_MS = 1000;
constexpr uint32_t WIFI_CONNECT_TIMEOUT_MS = 20000;
constexpr uint8_t GEMINI_TTS_MAX_ATTEMPTS = 3;
constexpr size_t TLS_WRITE_CHUNK_BYTES = 64;
constexpr size_t TTS_PCM_CHUNK_BYTES = 256;

int16_t *recordingBuffer = nullptr;
int16_t i2sOutputBuffer[MONO_SAMPLES_PER_CHUNK * 2];
int32_t i2sInputBuffer[MONO_SAMPLES_PER_CHUNK * 2];

struct TtsPcmChunk {
  uint8_t *data;
  size_t used;
  TtsPcmChunk *next;
};

TtsPcmChunk *ttsPcmHead = nullptr;
TtsPcmChunk *ttsPcmTail = nullptr;
TtsPcmChunk *playbackChunk = nullptr;
size_t ttsPcmBytes = 0;
uint32_t ttsPlaybackSampleRate = TTS_SAMPLE_RATE;
size_t recordedSampleCount = 0;
size_t playbackCursor = 0;
size_t playbackChunkOffset = 0;
uint32_t lastMicDebugMs = 0;
bool i2sReady = false;
volatile bool thinkingAnimationActive = false;

bool lastButtonReading = HIGH;
bool stableButtonReading = HIGH;
uint32_t lastButtonChangeMs = 0;

enum class AudioMode {
  Microphone,
  Thinking,
  Speaker,
};

AudioMode audioMode = AudioMode::Microphone;

enum class I2SBusMode {
  None,
  Microphone,
  Speaker,
};

struct HttpBodyReader {
  WiFiClientSecure *client;
  bool chunked;
  int contentLength;
  int bytesRead;
  int chunkRemaining;
  bool finished;
};

I2SBusMode i2sBusMode = I2SBusMode::None;

void playTestTone(uint32_t sampleRate);
void printClipStats();

#if ESP_IDF_VERSION_MAJOR >= 5
constexpr i2s_comm_format_t I2S_COMM_FORMAT_USED = I2S_COMM_FORMAT_STAND_I2S;
#else
constexpr i2s_comm_format_t I2S_COMM_FORMAT_USED = I2S_COMM_FORMAT_I2S;
#endif

void setNeoPixel(uint8_t red, uint8_t green, uint8_t blue) {
  red = (static_cast<uint16_t>(red) * NEOPIXEL_BRIGHTNESS) / 255;
  green = (static_cast<uint16_t>(green) * NEOPIXEL_BRIGHTNESS) / 255;
  blue = (static_cast<uint16_t>(blue) * NEOPIXEL_BRIGHTNESS) / 255;
  neopixelWrite(NEOPIXEL_PIN, red, green, blue);
}

void setNeoPixelWheel(uint8_t position) {
  if (position < 85) {
    setNeoPixel(255 - position * 3, position * 3, 0);
  } else if (position < 170) {
    position -= 85;
    setNeoPixel(0, 255 - position * 3, position * 3);
  } else {
    position -= 170;
    setNeoPixel(position * 3, 0, 255 - position * 3);
  }
}

void thinkingAnimationTask(void *parameter) {
  uint8_t hue = 0;
  while (thinkingAnimationActive) {
    setNeoPixelWheel(hue++);
    vTaskDelay(pdMS_TO_TICKS(25));
  }
  vTaskDelete(nullptr);
}

void startThinkingAnimation() {
  thinkingAnimationActive = true;
  const BaseType_t created = xTaskCreatePinnedToCore(thinkingAnimationTask,
                                                     "thinking_led",
                                                     2048,
                                                     nullptr,
                                                     1,
                                                     nullptr,
                                                     0);
  if (created != pdPASS) {
    Serial.println("Could not start thinking LED task");
  }
}

void stopThinkingAnimation() {
  thinkingAnimationActive = false;
  delay(40);
}

void showStatus(const __FlashStringHelper *line1,
                const String &line2 = String()) {
  Serial.println(line1);
  if (!line2.isEmpty()) {
    Serial.println(line2);
  }
}

bool allocateRecordingBuffer() {
  if (recordingBuffer != nullptr) {
    return true;
  }

  const size_t bufferBytes = MAX_RECORDING_SAMPLES * sizeof(int16_t);
  recordingBuffer = static_cast<int16_t *>(
      heap_caps_malloc(bufferBytes, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT));

  if (recordingBuffer == nullptr) {
    recordingBuffer =
        static_cast<int16_t *>(heap_caps_malloc(bufferBytes, MALLOC_CAP_8BIT));
  }

  if (recordingBuffer == nullptr) {
    Serial.printf("Could not allocate %u bytes for recording\n",
                  static_cast<unsigned>(bufferBytes));
    return false;
  }

  memset(recordingBuffer, 0, bufferBytes);
  return true;
}

void freeRecordingBuffer() {
  if (recordingBuffer != nullptr) {
    heap_caps_free(recordingBuffer);
    recordingBuffer = nullptr;
  }
  recordedSampleCount = 0;
}

void freeTtsAudio() {
  TtsPcmChunk *chunk = ttsPcmHead;
  while (chunk != nullptr) {
    TtsPcmChunk *next = chunk->next;
    if (chunk->data != nullptr) {
      heap_caps_free(chunk->data);
    }
    heap_caps_free(chunk);
    chunk = next;
  }
  ttsPcmHead = nullptr;
  ttsPcmTail = nullptr;
  playbackChunk = nullptr;
  ttsPcmBytes = 0;
  ttsPlaybackSampleRate = TTS_SAMPLE_RATE;
}

void uninstallI2S() {
  if (i2sReady) {
    i2s_driver_uninstall(I2S_NUM_0);
    i2sReady = false;
  }
  i2sBusMode = I2SBusMode::None;
}

