smitamw/esp32s3-assistant/ai_assistant_esp32s3/ai_assistant_esp32s3.ino
bool installI2S(i2s_mode_t direction,
                i2s_bits_per_sample_t bitsPerSample,
                uint32_t sampleRate,
                int bitClockPin,
                int wordSelectPin,
                int dataOutPin,
                int dataInPin,
                I2SBusMode busMode) {
  uninstallI2S();

  i2s_config_t i2sConfig = {};
  i2sConfig.mode = static_cast<i2s_mode_t>(I2S_MODE_MASTER | direction);
  i2sConfig.sample_rate = sampleRate;
  i2sConfig.bits_per_sample = bitsPerSample;
  i2sConfig.channel_format = I2S_CHANNEL_FMT_RIGHT_LEFT;
  i2sConfig.communication_format = I2S_COMM_FORMAT_USED;
  i2sConfig.intr_alloc_flags = ESP_INTR_FLAG_LEVEL1;
  i2sConfig.dma_buf_count = 8;
  i2sConfig.dma_buf_len = 256;
  i2sConfig.use_apll = false;
  i2sConfig.tx_desc_auto_clear = true;

  i2s_pin_config_t pinConfig = {};
#if ESP_IDF_VERSION_MAJOR >= 5
  pinConfig.mck_io_num = I2S_PIN_NO_CHANGE;
#endif
  pinConfig.bck_io_num = bitClockPin;
  pinConfig.ws_io_num = wordSelectPin;
  pinConfig.data_out_num = dataOutPin;
  pinConfig.data_in_num = dataInPin;

  esp_err_t err = i2s_driver_install(I2S_NUM_0, &i2sConfig, 0, nullptr);
  if (err != ESP_OK) {
    Serial.printf("i2s_driver_install failed: %d\n", err);
    return false;
  }

  err = i2s_set_pin(I2S_NUM_0, &pinConfig);
  if (err != ESP_OK) {
    Serial.printf("i2s_set_pin failed: %d\n", err);
    i2s_driver_uninstall(I2S_NUM_0);
    return false;
  }

  i2s_zero_dma_buffer(I2S_NUM_0);
  i2sReady = true;
  i2sBusMode = busMode;
  return true;
}

bool setupMicrophoneI2S() {
  if (i2sBusMode == I2SBusMode::Microphone) {
    return true;
  }

  return installI2S(I2S_MODE_RX,
                    I2S_BITS_PER_SAMPLE_32BIT,
                    AUDIO_SAMPLE_RATE,
                    MIC_I2S_SCK_PIN,
                    MIC_I2S_WS_PIN,
                    I2S_PIN_NO_CHANGE,
                    MIC_I2S_DIN_PIN,
                    I2SBusMode::Microphone);
}

bool setupSpeakerI2S(uint32_t sampleRate) {
  return installI2S(I2S_MODE_TX,
                    I2S_BITS_PER_SAMPLE_16BIT,
                    sampleRate,
                    SPEAKER_I2S_BCLK_PIN,
                    SPEAKER_I2S_LRCLK_PIN,
                    SPEAKER_I2S_DOUT_PIN,
                    I2S_PIN_NO_CHANGE,
                    I2SBusMode::Speaker);
}

void enterMicrophoneMode(bool clearClip) {
  audioMode = AudioMode::Microphone;
  digitalWrite(AMP_SD_PIN, LOW);
  setNeoPixel(255, 0, 0);
  playbackCursor = 0;
  playbackChunkOffset = 0;
  freeTtsAudio();

  if (!allocateRecordingBuffer()) {
    showStatus(F("Memory failed"), F("No recording buffer"));
    return;
  }

  if (clearClip) {
    recordedSampleCount = 0;
  }

  setupMicrophoneI2S();
  showStatus(F("Recording"), F("Press button to ask"));
}

void enterSpeakerMode() {
  audioMode = AudioMode::Speaker;
  playbackCursor = 0;
  playbackChunk = ttsPcmHead;
  playbackChunkOffset = 0;
  setNeoPixel(0, 255, 0);

  if (ttsPcmHead == nullptr || ttsPcmBytes == 0) {
    Serial.println("Speaker mode requested, but no TTS audio is available");
    enterMicrophoneMode(true);
    return;
  }

  if (!setupSpeakerI2S(ttsPlaybackSampleRate)) {
    Serial.println("Could not switch I2S to speaker mode");
    enterMicrophoneMode(false);
    return;
  }

  digitalWrite(AMP_SD_PIN, HIGH);
  delay(5);
  i2s_zero_dma_buffer(I2S_NUM_0);
  String sampleCountText = String(ttsPcmBytes / sizeof(int16_t));
  sampleCountText += F(" @ ");
  sampleCountText += String(ttsPlaybackSampleRate);
  sampleCountText += F(" Hz");
  showStatus(F("Speaking"), sampleCountText);
}

bool connectWifi() {
  if (WiFi.status() == WL_CONNECTED) {
    return true;
  }

  showStatus(F("Connecting WiFi"), WIFI_SSID);
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  const uint32_t startedAt = millis();
  while (WiFi.status() != WL_CONNECTED &&
         millis() - startedAt < WIFI_CONNECT_TIMEOUT_MS) {
    delay(250);
    Serial.print('.');
  }
  Serial.println();

  if (WiFi.status() != WL_CONNECTED) {
    showStatus(F("WiFi failed"));
    return false;
  }

  showStatus(F("WiFi connected"), WiFi.localIP().toString());
  return true;
}

void appendLittleEndian16(uint8_t *buffer, size_t offset, uint16_t value) {
  buffer[offset] = value & 0xFF;
  buffer[offset + 1] = (value >> 8) & 0xFF;
}

void appendLittleEndian32(uint8_t *buffer, size_t offset, uint32_t value) {
  buffer[offset] = value & 0xFF;
  buffer[offset + 1] = (value >> 8) & 0xFF;
  buffer[offset + 2] = (value >> 16) & 0xFF;
  buffer[offset + 3] = (value >> 24) & 0xFF;
}

void buildWavHeader(uint8_t *wavHeader) {
  const size_t pcmBytes = recordedSampleCount * sizeof(int16_t);
  const size_t wavBytes = 44 + pcmBytes;

  memcpy(wavHeader, "RIFF", 4);
  appendLittleEndian32(wavHeader, 4, wavBytes - 8);
  memcpy(wavHeader + 8, "WAVEfmt ", 8);
  appendLittleEndian32(wavHeader, 16, 16);
  appendLittleEndian16(wavHeader, 20, 1);
  appendLittleEndian16(wavHeader, 22, 1);
  appendLittleEndian32(wavHeader, 24, AUDIO_SAMPLE_RATE);
  appendLittleEndian32(wavHeader, 28, AUDIO_SAMPLE_RATE * 2);
  appendLittleEndian16(wavHeader, 32, 2);
  appendLittleEndian16(wavHeader, 34, 16);
  memcpy(wavHeader + 36, "data", 4);
  appendLittleEndian32(wavHeader, 40, pcmBytes);
}

bool writeAll(WiFiClientSecure &client, const uint8_t *data, size_t length) {
  size_t written = 0;
  while (written < length) {
    const size_t bytesThisWrite =
        min(TLS_WRITE_CHUNK_BYTES, length - written);
    size_t chunkWritten = 0;

    for (uint8_t attempt = 0; attempt < 50 && chunkWritten == 0; ++attempt) {
      chunkWritten = client.write(data + written, bytesThisWrite);
      if (chunkWritten == 0) {
        while (client.available()) {
          Serial.write(client.read());
        }
        delay(10);
      }
    }

    if (chunkWritten == 0) {
      return false;
    }
    written += chunkWritten;
    delay(0);
  }
  return true;
}

bool writeAll(WiFiClientSecure &client, const char *text) {
  return writeAll(client,
                  reinterpret_cast<const uint8_t *>(text),
                  strlen(text));
}

bool writeBase64Triplet(WiFiClientSecure &client,
                        const uint8_t *data,
                        size_t length) {
  char encoded[8];
  size_t encodedLength = 0;
  if (mbedtls_base64_encode(reinterpret_cast<unsigned char *>(encoded),
                            sizeof(encoded),
                            &encodedLength,
                            data,
                            length) != 0) {
    return false;
  }

  return writeAll(client,
                  reinterpret_cast<const uint8_t *>(encoded),
                  encodedLength);
}

bool writeBase64StreamChunk(WiFiClientSecure &client,
                            const uint8_t *data,
                            size_t length,
                            uint8_t *carry,
                            size_t &carryLength) {
  size_t offset = 0;

  if (carryLength > 0) {
    while (carryLength < 3 && offset < length) {
      carry[carryLength++] = data[offset++];
    }
    if (carryLength == 3) {
      if (!writeBase64Triplet(client, carry, 3)) {
        return false;
      }
      carryLength = 0;
    }
  }

  uint8_t encodeBuffer[384];
  char encodedBuffer[512];
  while (length - offset >= 3) {
    const size_t rawLength =
        min(sizeof(encodeBuffer), ((length - offset) / 3) * 3);
    memcpy(encodeBuffer, data + offset, rawLength);

