smitamw/esp32s3-assistant/ai_assistant_esp32s3/ai_assistant_esp32s3.ino
    size_t encodedLength = 0;
    if (mbedtls_base64_encode(
            reinterpret_cast<unsigned char *>(encodedBuffer),
            sizeof(encodedBuffer),
            &encodedLength,
            encodeBuffer,
            rawLength) != 0) {
      return false;
    }

    if (!writeAll(client,
                  reinterpret_cast<const uint8_t *>(encodedBuffer),
                  encodedLength)) {
      return false;
    }

    offset += rawLength;
  }

  while (offset < length) {
    carry[carryLength++] = data[offset++];
  }

  return true;
}

bool finishBase64Stream(WiFiClientSecure &client,
                        uint8_t *carry,
                        size_t &carryLength) {
  if (carryLength == 0) {
    return true;
  }

  const bool ok = writeBase64Triplet(client, carry, carryLength);
  carryLength = 0;
  return ok;
}

uint16_t readLittleEndian16(const uint8_t *buffer) {
  return static_cast<uint16_t>(buffer[0]) |
         (static_cast<uint16_t>(buffer[1]) << 8);
}

uint32_t readLittleEndian32(const uint8_t *buffer) {
  return static_cast<uint32_t>(buffer[0]) |
         (static_cast<uint32_t>(buffer[1]) << 8) |
         (static_cast<uint32_t>(buffer[2]) << 16) |
         (static_cast<uint32_t>(buffer[3]) << 24);
}

bool decodeWavPcmInPlace(uint8_t *buffer,
                         size_t decodedBytes,
                         size_t &pcmOffset,
                         size_t &pcmBytes,
                         uint32_t &sampleRate) {
  uint16_t audioFormat = 0;
  uint16_t channelCount = 0;
  uint16_t bitsPerSample = 0;
  bool foundFmt = false;
  bool foundData = false;
  size_t offset = 12;

  while (offset + 8 <= decodedBytes) {
    const uint8_t *chunk = buffer + offset;
    const uint32_t chunkSize = readLittleEndian32(chunk + 4);
    const size_t chunkDataOffset = offset + 8;
    if (chunkDataOffset + chunkSize > decodedBytes) {
      Serial.println("WAV chunk extends past decoded TTS audio");
      return false;
    }

    if (memcmp(chunk, "fmt ", 4) == 0) {
      if (chunkSize < 16) {
        Serial.println("WAV fmt chunk is too short");
        return false;
      }
      audioFormat = readLittleEndian16(buffer + chunkDataOffset);
      channelCount = readLittleEndian16(buffer + chunkDataOffset + 2);
      sampleRate = readLittleEndian32(buffer + chunkDataOffset + 4);
      bitsPerSample = readLittleEndian16(buffer + chunkDataOffset + 14);
      foundFmt = true;
    } else if (memcmp(chunk, "data", 4) == 0) {
      pcmOffset = chunkDataOffset;
      pcmBytes = chunkSize;
      foundData = true;
    }

    offset = chunkDataOffset + chunkSize + (chunkSize % 2);
  }

  if (!foundFmt || !foundData) {
    Serial.println("WAV TTS audio is missing fmt or data chunk");
    return false;
  }

  if (audioFormat != 1 || bitsPerSample != 16) {
    Serial.printf("Unsupported TTS WAV format: format=%u bits=%u\n",
                  audioFormat,
                  bitsPerSample);
    return false;
  }

  if (channelCount != 1 && channelCount != 2) {
    Serial.printf("Unsupported TTS WAV channel count: %u\n", channelCount);
    return false;
  }

  if (channelCount == 2) {
    const size_t stereoFrames = pcmBytes / (2 * sizeof(int16_t));
    int16_t *pcm = reinterpret_cast<int16_t *>(buffer + pcmOffset);
    for (size_t i = 0; i < stereoFrames; ++i) {
      const int32_t mixed =
          (static_cast<int32_t>(pcm[i * 2]) + pcm[i * 2 + 1]) / 2;
      pcm[i] = static_cast<int16_t>(mixed);
    }
    pcmBytes = stereoFrames * sizeof(int16_t);
  }

  if (pcmOffset > 0 && pcmBytes > 0) {
    memmove(buffer, buffer + pcmOffset, pcmBytes);
    pcmOffset = 0;
  }

  return pcmBytes > 0;
}

void printPcmStats(const char *label, const uint8_t *buffer, size_t pcmBytes) {
  if (pcmBytes < sizeof(int16_t)) {
    Serial.printf("%s PCM stats: no samples\n", label);
    return;
  }

  const int16_t *samples = reinterpret_cast<const int16_t *>(buffer);
  const size_t sampleCount = pcmBytes / sizeof(int16_t);
  int16_t minSample = 32767;
  int16_t maxSample = -32768;
  uint64_t levelSum = 0;

  for (size_t i = 0; i < sampleCount; ++i) {
    const int16_t sample = samples[i];
    minSample = min(minSample, sample);
    maxSample = max(maxSample, sample);
    levelSum += abs(static_cast<int32_t>(sample));
  }

  Serial.printf("%s PCM stats: min=%d max=%d avg_abs=%lu\n",
                label,
                minSample,
                maxSample,
                static_cast<unsigned long>(levelSum / sampleCount));
}

uint32_t sampleRateFromMimeType(const String &mimeType, uint32_t fallback) {
  int rateIndex = mimeType.indexOf("rate=");
  if (rateIndex < 0) {
    rateIndex = mimeType.indexOf("sample_rate=");
  }
  if (rateIndex < 0) {
    return fallback;
  }

  const int valueStart = mimeType.indexOf('=', rateIndex) + 1;
  if (valueStart <= 0) {
    return fallback;
  }

  uint32_t rate = 0;
  for (int i = valueStart; i < static_cast<int>(mimeType.length()); ++i) {
    const char c = mimeType[i];
    if (c < '0' || c > '9') {
      break;
    }
    rate = rate * 10 + static_cast<uint32_t>(c - '0');
  }

  return rate > 0 ? rate : fallback;
}

bool isRawPcmMimeType(const String &mimeType) {
  if (mimeType.isEmpty()) {
    return true;
  }

  String normalized = mimeType;
  normalized.toLowerCase();
  return normalized.indexOf("audio/l16") >= 0 ||
         normalized.indexOf("audio/pcm") >= 0 ||
         normalized.indexOf("audio/raw") >= 0 ||
         normalized.indexOf("s16le") >= 0;
}

void printAudioHeaderBytes(const uint8_t *buffer, size_t length) {
  Serial.print("TTS first bytes:");
  const size_t bytesToPrint = min(static_cast<size_t>(16), length);
  for (size_t i = 0; i < bytesToPrint; ++i) {
    Serial.printf(" %02X", buffer[i]);
  }
  Serial.println();
}

bool readHttpBody(WiFiClientSecure &client, int &statusCode, String &body) {
  const uint32_t deadline = millis() + 60000;
  while (!client.available() && millis() < deadline) {
    delay(10);
  }

  const String statusLine = client.readStringUntil('\n');
  statusCode = 0;
  const int firstSpace = statusLine.indexOf(' ');
  if (firstSpace >= 0) {
    statusCode = statusLine.substring(firstSpace + 1, firstSpace + 4).toInt();
  }

  bool chunked = false;
  int contentLength = -1;
  while (client.connected() || client.available()) {
    String header = client.readStringUntil('\n');
    header.trim();
    if (header.length() == 0) {
      break;
    }
    header.toLowerCase();
    if (header.indexOf(F("transfer-encoding: chunked")) >= 0) {
      chunked = true;
    } else if (header.startsWith(F("content-length:"))) {
      contentLength = header.substring(strlen("content-length:")).toInt();
    }
  }

  body = "";
  if (contentLength > 0) {
    body.reserve(contentLength + 1);
  }

  if (chunked) {
    while (client.connected() || client.available()) {
      String sizeLine = client.readStringUntil('\n');
      sizeLine.trim();
      const int chunkSize = strtol(sizeLine.c_str(), nullptr, 16);
      if (chunkSize <= 0) {
        break;
      }
      for (int i = 0; i < chunkSize; ++i) {
        const uint32_t byteDeadline = millis() + 60000;
        while (!client.available() && millis() < byteDeadline) {
          delay(5);
        }
        if (!client.available()) {
          return false;
        }
        body += static_cast<char>(client.read());
      }
      client.readStringUntil('\n');
    }
  } else if (contentLength >= 0) {
    while (static_cast<int>(body.length()) < contentLength) {
      const uint32_t byteDeadline = millis() + 60000;
      while (!client.available() && client.connected() && millis() < byteDeadline) {
        delay(5);
      }
      if (!client.available()) {
        break;
      }
      while (client.available() &&
             static_cast<int>(body.length()) < contentLength) {
        body += static_cast<char>(client.read());
      }
    }

    if (static_cast<int>(body.length()) != contentLength) {
      Serial.printf("HTTP body was short: got %u of %d bytes\n",
                    static_cast<unsigned>(body.length()),
                    contentLength);
      return false;
    }
  } else {
    while (client.connected() || client.available()) {
      while (client.available()) {
        body += static_cast<char>(client.read());
      }
      delay(5);
    }
  }

