smitamw/esp32s3-assistant/ai_assistant_esp32s3/ai_assistant_esp32s3.ino
  return statusCode > 0;
}

bool waitForClientData(WiFiClientSecure &client, uint32_t timeoutMs = 60000) {
  const uint32_t deadline = millis() + timeoutMs;
  while (!client.available() && client.connected() && millis() < deadline) {
    delay(5);
  }
  return client.available();
}

bool readHttpHeaders(WiFiClientSecure &client,
                     int &statusCode,
                     bool &chunked,
                     int &contentLength) {
  const uint32_t deadline = millis() + 60000;
  while (!client.available() && millis() < deadline) {
    delay(10);
  }

  const String statusLine = client.readStringUntil('\n');
  statusCode = 0;
  const int firstSpace = statusLine.indexOf(' ');
  if (firstSpace >= 0) {
    statusCode = statusLine.substring(firstSpace + 1, firstSpace + 4).toInt();
  }

  chunked = false;
  contentLength = -1;
  while (client.connected() || client.available()) {
    String header = client.readStringUntil('\n');
    header.trim();
    if (header.length() == 0) {
      break;
    }
    header.toLowerCase();
    if (header.indexOf(F("transfer-encoding: chunked")) >= 0) {
      chunked = true;
    } else if (header.startsWith(F("content-length:"))) {
      contentLength = header.substring(strlen("content-length:")).toInt();
    }
  }

  return statusCode > 0;
}

bool readHttpBodyByte(HttpBodyReader &reader, char &out) {
  if (reader.finished) {
    return false;
  }

  if (reader.chunked) {
    while (reader.chunkRemaining <= 0) {
      if (!waitForClientData(*reader.client)) {
        reader.finished = true;
        return false;
      }

      String sizeLine = reader.client->readStringUntil('\n');
      sizeLine.trim();
      if (sizeLine.length() == 0) {
        continue;
      }

      reader.chunkRemaining = strtol(sizeLine.c_str(), nullptr, 16);
      if (reader.chunkRemaining <= 0) {
        reader.finished = true;
        return false;
      }
    }

    if (!waitForClientData(*reader.client)) {
      reader.finished = true;
      return false;
    }

    out = static_cast<char>(reader.client->read());
    --reader.chunkRemaining;
    ++reader.bytesRead;
    if (reader.chunkRemaining == 0) {
      reader.client->readStringUntil('\n');
    }
    return true;
  }

  if (reader.contentLength >= 0 && reader.bytesRead >= reader.contentLength) {
    reader.finished = true;
    return false;
  }

  if (!waitForClientData(*reader.client)) {
    reader.finished = true;
    return false;
  }

  out = static_cast<char>(reader.client->read());
  ++reader.bytesRead;
  return true;
}

bool parseHttpsUrl(const String &url, String &host, String &path) {
  constexpr char prefix[] = "https://";
  if (!url.startsWith(prefix)) {
    return false;
  }

  const int hostStart = strlen(prefix);
  const int pathStart = url.indexOf('/', hostStart);
  if (pathStart < 0) {
    return false;
  }

  host = url.substring(hostStart, pathStart);
  path = url.substring(pathStart);
  return host.length() > 0 && path.length() > 0;
}

String jsonEscape(const String &value) {
  String escaped;
  escaped.reserve(value.length() + 16);

  for (size_t i = 0; i < value.length(); ++i) {
    const char c = value[i];
    switch (c) {
      case '"':
        escaped += F("\\\"");
        break;
      case '\\':
        escaped += F("\\\\");
        break;
      case '\n':
        escaped += F("\\n");
        break;
      case '\r':
        escaped += F("\\r");
        break;
      case '\t':
        escaped += F("\\t");
        break;
      default:
        if (static_cast<uint8_t>(c) < 0x20) {
          escaped += ' ';
        } else {
          escaped += c;
        }
        break;
    }
  }

  return escaped;
}

bool appendJsonStringValue(const String &json, int keyIndex, String &value) {
  int colon = json.indexOf(':', keyIndex);
  if (colon < 0) {
    return false;
  }

  int start = json.indexOf('"', colon + 1);
  if (start < 0) {
    return false;
  }

  value = "";
  bool escaping = false;
  for (int i = start + 1; i < static_cast<int>(json.length()); ++i) {
    const char c = json[i];
    if (escaping) {
      switch (c) {
        case 'n':
          value += '\n';
          break;
        case 'r':
          value += '\r';
          break;
        case 't':
          value += '\t';
          break;
        default:
          value += c;
          break;
      }
      escaping = false;
    } else if (c == '\\') {
      escaping = true;
    } else if (c == '"') {
      return true;
    } else {
      value += c;
    }
  }

  return false;
}

bool extractJsonStringAfter(const String &json,
                            const char *anchor,
                            const char *key,
                            String &value) {
  int start = anchor == nullptr ? 0 : json.indexOf(anchor);
  if (start < 0) {
    return false;
  }

  const int keyIndex = json.indexOf(key, start);
  if (keyIndex < 0) {
    return false;
  }

  return appendJsonStringValue(json, keyIndex, value);
}

bool findJsonStringBoundsAfter(const String &json,
                               const char *anchor,
                               const char *key,
                               int &valueStart,
                               int &valueLength) {
  int searchStart = anchor == nullptr ? 0 : json.indexOf(anchor);
  if (searchStart < 0) {
    return false;
  }

  const int keyIndex = json.indexOf(key, searchStart);
  if (keyIndex < 0) {
    return false;
  }

  const int colon = json.indexOf(':', keyIndex);
  if (colon < 0) {
    return false;
  }

  valueStart = json.indexOf('"', colon + 1);
  if (valueStart < 0) {
    return false;
  }
  ++valueStart;

  bool escaping = false;
  for (int i = valueStart; i < static_cast<int>(json.length()); ++i) {
    const char c = json[i];
    if (escaping) {
      escaping = false;
    } else if (c == '\\') {
      escaping = true;
    } else if (c == '"') {
      valueLength = i - valueStart;
      return true;
    }
  }

  Serial.println("JSON string was not terminated; refusing partial audio");
  return false;
}

bool addTtsPcmChunk() {
  TtsPcmChunk *chunk =
      static_cast<TtsPcmChunk *>(heap_caps_malloc(sizeof(TtsPcmChunk),
                                                  MALLOC_CAP_8BIT));
  if (chunk == nullptr) {
    Serial.println("Could not allocate TTS PCM chunk metadata");
    return false;
  }

