smitamw/esp32s3-assistant/ai_assistant_esp32s3/ai_assistant_esp32s3.ino
  chunk->data = static_cast<uint8_t *>(heap_caps_malloc(
      TTS_PCM_CHUNK_BYTES, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT));
  if (chunk->data == nullptr) {
    chunk->data = static_cast<uint8_t *>(heap_caps_malloc(
        TTS_PCM_CHUNK_BYTES, MALLOC_CAP_8BIT));
  }
  if (chunk->data == nullptr) {
    heap_caps_free(chunk);
    Serial.printf("Could not allocate %u-byte TTS PCM chunk\n",
                  static_cast<unsigned>(TTS_PCM_CHUNK_BYTES));
    return false;
  }

  chunk->used = 0;
  chunk->next = nullptr;
  if (ttsPcmTail == nullptr) {
    ttsPcmHead = chunk;
  } else {
    ttsPcmTail->next = chunk;
  }
  ttsPcmTail = chunk;
  return true;
}

bool appendTtsPcmBytes(const uint8_t *data, size_t length) {
  size_t copied = 0;
  while (copied < length) {
    if (ttsPcmTail == nullptr || ttsPcmTail->used >= TTS_PCM_CHUNK_BYTES) {
      if (!addTtsPcmChunk()) {
        return false;
      }
    }

    const size_t available = TTS_PCM_CHUNK_BYTES - ttsPcmTail->used;
    const size_t bytesThisCopy = min(available, length - copied);
    memcpy(ttsPcmTail->data + ttsPcmTail->used,
           data + copied,
           bytesThisCopy);
    ttsPcmTail->used += bytesThisCopy;
    ttsPcmBytes += bytesThisCopy;
    copied += bytesThisCopy;
  }

  return true;
}

void freeTtsChunkChain(TtsPcmChunk *chunk) {
  while (chunk != nullptr) {
    TtsPcmChunk *next = chunk->next;
    if (chunk->data != nullptr) {
      heap_caps_free(chunk->data);
    }
    heap_caps_free(chunk);
    chunk = next;
  }
}

bool readTtsByteAt(size_t offset, uint8_t &value) {
  TtsPcmChunk *chunk = ttsPcmHead;
  while (chunk != nullptr) {
    if (offset < chunk->used) {
      value = chunk->data[offset];
      return true;
    }
    offset -= chunk->used;
    chunk = chunk->next;
  }

  return false;
}

bool writeTtsByteAt(size_t offset, uint8_t value) {
  TtsPcmChunk *chunk = ttsPcmHead;
  while (chunk != nullptr) {
    if (offset < chunk->used) {
      chunk->data[offset] = value;
      return true;
    }
    offset -= chunk->used;
    chunk = chunk->next;
  }

  return false;
}

bool readTtsBytesAt(size_t offset, uint8_t *buffer, size_t length) {
  for (size_t i = 0; i < length; ++i) {
    if (!readTtsByteAt(offset + i, buffer[i])) {
      return false;
    }
  }
  return true;
}

bool readTtsLittleEndian16At(size_t offset, uint16_t &value) {
  uint8_t bytes[2];
  if (!readTtsBytesAt(offset, bytes, sizeof(bytes))) {
    return false;
  }
  value = readLittleEndian16(bytes);
  return true;
}

bool readTtsLittleEndian32At(size_t offset, uint32_t &value) {
  uint8_t bytes[4];
  if (!readTtsBytesAt(offset, bytes, sizeof(bytes))) {
    return false;
  }
  value = readLittleEndian32(bytes);
  return true;
}

bool writeTtsLittleEndian16At(size_t offset, int16_t value) {
  const uint16_t unsignedValue = static_cast<uint16_t>(value);
  return writeTtsByteAt(offset, unsignedValue & 0xFF) &&
         writeTtsByteAt(offset + 1, (unsignedValue >> 8) & 0xFF);
}

void resetTtsPlaybackCursor() {
  playbackChunk = ttsPcmHead;
  playbackChunkOffset = 0;
  playbackCursor = 0;
}

bool discardTtsPrefix(size_t bytesToDiscard) {
  while (ttsPcmHead != nullptr && bytesToDiscard >= ttsPcmHead->used) {
    bytesToDiscard -= ttsPcmHead->used;
    ttsPcmBytes -= ttsPcmHead->used;
    TtsPcmChunk *next = ttsPcmHead->next;
    if (ttsPcmHead->data != nullptr) {
      heap_caps_free(ttsPcmHead->data);
    }
    heap_caps_free(ttsPcmHead);
    ttsPcmHead = next;
  }

  if (ttsPcmHead == nullptr) {
    ttsPcmTail = nullptr;
    resetTtsPlaybackCursor();
    return bytesToDiscard == 0;
  }

  if (bytesToDiscard > 0) {
    memmove(ttsPcmHead->data,
            ttsPcmHead->data + bytesToDiscard,
            ttsPcmHead->used - bytesToDiscard);
    ttsPcmHead->used -= bytesToDiscard;
    ttsPcmBytes -= bytesToDiscard;
  }

  resetTtsPlaybackCursor();
  return true;
}

void truncateTtsBytes(size_t newLength) {
  if (newLength >= ttsPcmBytes) {
    return;
  }

  if (newLength == 0) {
    freeTtsAudio();
    return;
  }

  size_t remaining = newLength;
  TtsPcmChunk *chunk = ttsPcmHead;
  TtsPcmChunk *previous = nullptr;

  while (chunk != nullptr && remaining > chunk->used) {
    remaining -= chunk->used;
    previous = chunk;
    chunk = chunk->next;
  }

  TtsPcmChunk *firstFree = nullptr;
  if (chunk != nullptr) {
    if (remaining == chunk->used) {
      firstFree = chunk->next;
      chunk->next = nullptr;
      ttsPcmTail = chunk;
    } else {
      chunk->used = remaining;
      firstFree = chunk->next;
      chunk->next = nullptr;
      ttsPcmTail = chunk;
    }
  } else if (previous != nullptr) {
    firstFree = previous->next;
    previous->next = nullptr;
    ttsPcmTail = previous;
  }

  freeTtsChunkChain(firstFree);
  ttsPcmBytes = newLength;
  resetTtsPlaybackCursor();
}

bool readPlaybackByte(uint8_t &value) {
  while (playbackChunk != nullptr && playbackChunkOffset >= playbackChunk->used) {
    playbackChunk = playbackChunk->next;
    playbackChunkOffset = 0;
  }

  if (playbackChunk == nullptr) {
    return false;
  }

  value = playbackChunk->data[playbackChunkOffset++];
  ++playbackCursor;
  return true;
}

bool readPlaybackSample(int16_t &sample) {
  uint8_t low = 0;
  uint8_t high = 0;
  if (!readPlaybackByte(low) || !readPlaybackByte(high)) {
    return false;
  }

  sample = static_cast<int16_t>(static_cast<uint16_t>(low) |
                                (static_cast<uint16_t>(high) << 8));
  return true;
}

void printTtsHeaderBytes() {
  Serial.print("TTS first bytes:");
  const size_t bytesToPrint = min(static_cast<size_t>(16), ttsPcmBytes);
  for (size_t i = 0; i < bytesToPrint; ++i) {
    uint8_t value = 0;
    if (readTtsByteAt(i, value)) {
      Serial.printf(" %02X", value);
    }
  }
  Serial.println();
}

void printTtsPcmStats() {
  if (ttsPcmBytes < sizeof(int16_t)) {
    Serial.println("TTS PCM stats: no samples");
    return;
  }

  TtsPcmChunk *savedPlaybackChunk = playbackChunk;
  const size_t savedPlaybackChunkOffset = playbackChunkOffset;
  const size_t savedPlaybackCursor = playbackCursor;
  playbackChunk = ttsPcmHead;
  playbackChunkOffset = 0;
  playbackCursor = 0;

  const size_t sampleCount = ttsPcmBytes / sizeof(int16_t);
  int16_t minSample = 32767;
  int16_t maxSample = -32768;
  uint64_t levelSum = 0;

  for (size_t i = 0; i < sampleCount; ++i) {
    int16_t sample = 0;
    if (!readPlaybackSample(sample)) {
      break;
    }
    minSample = min(minSample, sample);
    maxSample = max(maxSample, sample);
    levelSum += abs(static_cast<int32_t>(sample));
  }

  playbackChunk = savedPlaybackChunk;
  playbackChunkOffset = savedPlaybackChunkOffset;
  playbackCursor = savedPlaybackCursor;

  Serial.printf("TTS PCM stats: min=%d max=%d avg_abs=%lu\n",
                minSample,
                maxSample,
                static_cast<unsigned long>(levelSum / sampleCount));
}

