smitamw/esp32s3-assistant/ai_assistant_esp32s3/ai_assistant_esp32s3.ino
bool ttsStartsWithRiffWave() {
  if (ttsPcmBytes < 12) {
    return false;
  }

  uint8_t bytes[12];
  for (size_t i = 0; i < sizeof(bytes); ++i) {
    if (!readTtsByteAt(i, bytes[i])) {
      return false;
    }
  }

  return memcmp(bytes, "RIFF", 4) == 0 && memcmp(bytes + 8, "WAVE", 4) == 0;
}

bool normalizeTtsWavInPlace(uint32_t &sampleRate) {
  if (!ttsStartsWithRiffWave()) {
    return false;
  }

  uint16_t audioFormat = 0;
  uint16_t channelCount = 0;
  uint16_t bitsPerSample = 0;
  uint32_t wavSampleRate = 0;
  size_t dataOffset = 0;
  size_t dataBytes = 0;
  bool foundFmt = false;
  bool foundData = false;
  size_t offset = 12;

  while (offset + 8 <= ttsPcmBytes) {
    uint8_t chunkId[4];
    uint32_t chunkSize = 0;
    if (!readTtsBytesAt(offset, chunkId, sizeof(chunkId)) ||
        !readTtsLittleEndian32At(offset + 4, chunkSize)) {
      return false;
    }

    const size_t chunkDataOffset = offset + 8;
    if (chunkDataOffset + chunkSize > ttsPcmBytes) {
      Serial.println("TTS WAV chunk extends past decoded audio");
      return false;
    }

    if (memcmp(chunkId, "fmt ", 4) == 0) {
      if (chunkSize < 16) {
        Serial.println("TTS WAV fmt chunk is too short");
        return false;
      }
      uint16_t blockAlign = 0;
      if (!readTtsLittleEndian16At(chunkDataOffset, audioFormat) ||
          !readTtsLittleEndian16At(chunkDataOffset + 2, channelCount) ||
          !readTtsLittleEndian32At(chunkDataOffset + 4, wavSampleRate) ||
          !readTtsLittleEndian16At(chunkDataOffset + 12, blockAlign) ||
          !readTtsLittleEndian16At(chunkDataOffset + 14, bitsPerSample)) {
        return false;
      }
      if (blockAlign == 0) {
        Serial.println("TTS WAV block align is invalid");
        return false;
      }
      foundFmt = true;
    } else if (memcmp(chunkId, "data", 4) == 0) {
      dataOffset = chunkDataOffset;
      dataBytes = chunkSize;
      foundData = true;
    }

    offset = chunkDataOffset + chunkSize + (chunkSize % 2);
  }

  if (!foundFmt || !foundData) {
    Serial.println("TTS WAV audio is missing fmt or data chunk");
    return false;
  }

  if (audioFormat != 1 || bitsPerSample != 16) {
    Serial.printf("Unsupported TTS WAV format: format=%u bits=%u\n",
                  audioFormat,
                  bitsPerSample);
    return false;
  }

  if (channelCount != 1 && channelCount != 2) {
    Serial.printf("Unsupported TTS WAV channel count: %u\n", channelCount);
    return false;
  }

  if (channelCount == 1) {
    dataBytes -= dataBytes % sizeof(int16_t);
    if (!discardTtsPrefix(dataOffset)) {
      return false;
    }
    truncateTtsBytes(dataBytes);
  } else {
    const size_t stereoFrameBytes = 2 * sizeof(int16_t);
    const size_t stereoFrames = dataBytes / stereoFrameBytes;
    for (size_t i = 0; i < stereoFrames; ++i) {
      uint16_t leftRaw = 0;
      uint16_t rightRaw = 0;
      const size_t frameOffset = dataOffset + i * stereoFrameBytes;
      if (!readTtsLittleEndian16At(frameOffset, leftRaw) ||
          !readTtsLittleEndian16At(frameOffset + sizeof(int16_t), rightRaw)) {
        return false;
      }

      const int16_t left = static_cast<int16_t>(leftRaw);
      const int16_t right = static_cast<int16_t>(rightRaw);
      const int16_t mixed =
          static_cast<int16_t>((static_cast<int32_t>(left) + right) / 2);
      if (!writeTtsLittleEndian16At(i * sizeof(int16_t), mixed)) {
        return false;
      }
    }
    truncateTtsBytes(stereoFrames * sizeof(int16_t));
  }

  sampleRate = wavSampleRate;
  Serial.printf("TTS WAV normalized to mono PCM: %u bytes @ %lu Hz\n",
                static_cast<unsigned>(ttsPcmBytes),
                static_cast<unsigned long>(sampleRate));
  return ttsPcmBytes > 0 && sampleRate > 0;
}

bool decodeAndAppendBase64Quartet(char quartet[4]) {
  uint8_t decoded[3];
  size_t decodedLength = 0;
  const int result = mbedtls_base64_decode(
      decoded,
      sizeof(decoded),
      &decodedLength,
      reinterpret_cast<const unsigned char *>(quartet),
      4);
  if (result != 0) {
    Serial.println("Could not decode TTS base64 audio chunk");
    return false;
  }

  return appendTtsPcmBytes(decoded, decodedLength);
}

bool readGeminiTtsAudioResponse(WiFiClientSecure &client,
                                int &status,
                                String &audioMimeType) {
  bool chunked = false;
  int contentLength = -1;
  if (!readHttpHeaders(client, status, chunked, contentLength)) {
    return false;
  }

  if (status < 200 || status >= 300) {
    String errorBody;
    errorBody.reserve(contentLength > 0 ? min(contentLength, 1024) : 1024);
    HttpBodyReader errorReader = {
        &client, chunked, contentLength, 0, 0, false};
    char c = 0;
    while (readHttpBodyByte(errorReader, c) && errorBody.length() < 1024) {
      errorBody += c;
    }
    Serial.printf("Gemini TTS HTTP %d\n", status);
    Serial.println(errorBody);
    return false;
  }

  freeTtsAudio();

  HttpBodyReader reader = {&client, chunked, contentLength, 0, 0, false};
  enum class ParseState {
    Searching,
    SeekMimeColon,
    SeekMimeQuote,
    ReadMime,
    SeekDataColon,
    SeekDataQuote,
    ReadData,
    Done,
  };

  ParseState parseState = ParseState::Searching;
  String tail;
  tail.reserve(48);
  bool sawInlineData = false;
  bool escaping = false;
  char quartet[4] = {0, 0, 0, 0};
  size_t quartetLength = 0;
  char c = 0;

  while (readHttpBodyByte(reader, c)) {
    switch (parseState) {
      case ParseState::Searching:
        tail += c;
        if (tail.length() > 48) {
          tail.remove(0, tail.length() - 48);
        }
        if (tail.endsWith("\"inlineData\"") ||
            tail.endsWith("\"inline_data\"")) {
          sawInlineData = true;
        } else if (sawInlineData &&
                   (tail.endsWith("\"mimeType\"") ||
                    tail.endsWith("\"mime_type\""))) {
          parseState = ParseState::SeekMimeColon;
        } else if ((sawInlineData && tail.endsWith("\"data\"")) ||
                   tail.endsWith("\"audioContent\"") ||
                   tail.endsWith("\"audio_content\"")) {
          parseState = ParseState::SeekDataColon;
        }
        break;

      case ParseState::SeekMimeColon:
        if (c == ':') {
          parseState = ParseState::SeekMimeQuote;
        }
        break;

