smitamw/esp32s3-assistant/ai_assistant_esp32s3/ai_assistant_esp32s3.ino
      case ParseState::SeekMimeQuote:
        if (c == '"') {
          audioMimeType = "";
          escaping = false;
          parseState = ParseState::ReadMime;
        }
        break;

      case ParseState::ReadMime:
        if (escaping) {
          audioMimeType += c;
          escaping = false;
        } else if (c == '\\') {
          escaping = true;
        } else if (c == '"') {
          parseState = ParseState::Searching;
          tail = "";
        } else {
          audioMimeType += c;
        }
        break;

      case ParseState::SeekDataColon:
        if (c == ':') {
          parseState = ParseState::SeekDataQuote;
        }
        break;

      case ParseState::SeekDataQuote:
        if (c == '"') {
          escaping = false;
          quartetLength = 0;
          parseState = ParseState::ReadData;
        }
        break;

      case ParseState::ReadData:
        if (escaping) {
          quartet[quartetLength++] = c;
          if (quartetLength == 4) {
            if (!decodeAndAppendBase64Quartet(quartet)) {
              return false;
            }
            quartetLength = 0;
          }
          escaping = false;
        } else if (c == '\\') {
          escaping = true;
        } else if (c == '"') {
          if (quartetLength != 0) {
            Serial.println("TTS base64 audio ended on a partial quartet");
            return false;
          }
          parseState = ParseState::Done;
          break;
        } else if (c == '\n' || c == '\r' || c == '\t' || c == ' ') {
          break;
        } else {
          quartet[quartetLength++] = c;
          if (quartetLength == 4) {
            if (!decodeAndAppendBase64Quartet(quartet)) {
              return false;
            }
            quartetLength = 0;
          }
        }
        break;

      case ParseState::Done:
        break;
    }

    if (parseState == ParseState::Done) {
      break;
    }
  }

  if (parseState != ParseState::Done) {
    Serial.println("Gemini TTS audio data was not fully received");
    Serial.printf("TTS response bytes read: %u\n",
                  static_cast<unsigned>(reader.bytesRead));
    return false;
  }

  Serial.printf("TTS response bytes read: %u, decoded audio bytes: %u\n",
                static_cast<unsigned>(reader.bytesRead),
                static_cast<unsigned>(ttsPcmBytes));
  return true;
}

bool startGeminiFileUpload(String &uploadUrl) {
  const size_t wavBytes = 44 + recordedSampleCount * sizeof(int16_t);
  char metadata[] = "{\"file\":{\"display_name\":\"esp32-question.wav\"}}";

  WiFiClientSecure client;
  client.setInsecure();

  HTTPClient https;
  const String url = F("https://generativelanguage.googleapis.com/upload/v1beta/files");

  if (!https.begin(client, url)) {
    Serial.println("Could not begin Gemini upload start request");
    return false;
  }

  const char *headers[] = {"x-goog-upload-url"};
  https.collectHeaders(headers, 1);
  https.addHeader(F("Content-Type"), F("application/json"));
  https.addHeader(F("x-goog-api-key"), GEMINI_API_KEY);
  https.addHeader(F("X-Goog-Upload-Protocol"), F("resumable"));
  https.addHeader(F("X-Goog-Upload-Command"), F("start"));
  https.addHeader(F("X-Goog-Upload-Header-Content-Length"),
                  String(wavBytes));
  https.addHeader(F("X-Goog-Upload-Header-Content-Type"), F("audio/wav"));
  https.setTimeout(60000);

  const int status = https.POST(
      reinterpret_cast<uint8_t *>(metadata),
      strlen(metadata));
  uploadUrl = https.header("x-goog-upload-url");
  const String response = https.getString();
  https.end();

  if (status < 200 || status >= 300 || uploadUrl.isEmpty()) {
    Serial.printf("Gemini upload start HTTP %d\n", status);
    Serial.println(response);
    return false;
  }

  return true;
}

bool uploadRecordedWavFile(const String &uploadUrl, String &fileUri) {
  String host;
  String path;
  if (!parseHttpsUrl(uploadUrl, host, path)) {
    Serial.println("Could not parse Gemini upload URL");
    return false;
  }

  const size_t pcmBytes = recordedSampleCount * sizeof(int16_t);
  const size_t wavBytes = 44 + pcmBytes;

  WiFiClientSecure client;
  client.setInsecure();
  client.setTimeout(60000);

  if (!client.connect(host.c_str(), 443)) {
    Serial.println("Could not connect to Gemini upload URL");
    return false;
  }

  client.print(F("POST "));
  client.print(path);
  client.print(F(" HTTP/1.1\r\nHost: "));
  client.print(host);
  client.print(F("\r\nContent-Length: "));
  client.print(wavBytes);
  client.print(F("\r\nContent-Type: audio/wav"));
  client.print(F("\r\nX-Goog-Upload-Offset: 0"));
  client.print(F("\r\nX-Goog-Upload-Command: upload, finalize"));
  client.print(F("\r\nConnection: close\r\n\r\n"));

  uint8_t wavHeader[44];
  buildWavHeader(wavHeader);

  if (!writeAll(client, wavHeader, sizeof(wavHeader))) {
    Serial.println("Gemini file upload failed while writing WAV header");
    client.stop();
    return false;
  }
  if (!writeAll(client,
                reinterpret_cast<const uint8_t *>(recordingBuffer),
                pcmBytes)) {
    Serial.println("Gemini file upload failed while writing recorded PCM");
    client.stop();
    return false;
  }

  int status = 0;
  String response;
  if (!readHttpBody(client, status, response)) {
    Serial.println("Could not read Gemini file upload response");
    client.stop();
    return false;
  }
  client.stop();

  if (status < 200 || status >= 300) {
    Serial.printf("Gemini file upload HTTP %d\n", status);
    Serial.println(response);
    return false;
  }

  if (!extractJsonStringAfter(response, "\"file\"", "\"uri\"", fileUri)) {
    Serial.println("Could not parse Gemini file URI");
    Serial.println(response);
    return false;
  }

  Serial.println("Gemini file uploaded:");
  Serial.println(fileUri);
  return true;
}

String geminiGenerateTextFromFile(const String &fileUri) {
  String payload;
  payload.reserve(fileUri.length() + 512);
  payload += F("{\"contents\":[{\"parts\":[");
  payload += F("{\"text\":\"You are a concise voice assistant. Listen to the user's audio and answer naturally in one or two short sentences.\"},");
  payload += F("{\"file_data\":{\"mime_type\":\"audio/wav\",\"file_uri\":\"");
  payload += jsonEscape(fileUri);
  payload += F("\"}}]}],\"generationConfig\":{\"maxOutputTokens\":120}}");

  WiFiClientSecure client;
  client.setInsecure();

  HTTPClient https;
  const String url = String(F("https://generativelanguage.googleapis.com/v1beta/models/")) +
                     GEMINI_TEXT_MODEL + F(":generateContent");

  if (!https.begin(client, url)) {
    Serial.println("Could not begin Gemini text request");
    return String();
  }

