smitamw/esp32s3-assistant/ai_assistant_esp32s3/ai_assistant_esp32s3.ino
  https.addHeader(F("Content-Type"), F("application/json"));
  https.addHeader(F("x-goog-api-key"), GEMINI_API_KEY);
  https.setTimeout(60000);

  const int status = https.POST(payload);
  const String response = https.getString();
  https.end();

  if (status < 200 || status >= 300) {
    Serial.printf("Gemini text HTTP %d\n", status);
    Serial.println(response);
    return String();
  }

  String text;
  if (!extractJsonStringAfter(response, nullptr, "\"text\"", text)) {
    Serial.println("Could not parse Gemini text response");
    Serial.println(response);
    return String();
  }

  text.trim();
  Serial.println("Gemini response:");
  Serial.println(text);
  return text;
}

String geminiGenerateText() {
  String uploadUrl;
  if (!startGeminiFileUpload(uploadUrl)) {
    return String();
  }

  String fileUri;
  if (!uploadRecordedWavFile(uploadUrl, fileUri)) {
    return String();
  }

  return geminiGenerateTextFromFile(fileUri);
}

String geminiGenerateTextInline() {
  WiFiClientSecure client;
  client.setInsecure();
  client.setTimeout(60000);

  if (!client.connect("generativelanguage.googleapis.com", 443)) {
    Serial.println("Could not connect to Gemini");
    return String();
  }

  constexpr char payloadPrefix[] =
      "{\"contents\":[{\"parts\":["
      "{\"text\":\"You are a concise voice assistant. Listen to the user's audio and answer naturally in one or two short sentences.\"},"
      "{\"inlineData\":{\"mimeType\":\"audio/wav\",\"data\":\"";
  constexpr char payloadSuffix[] =
      "\"}}]}],\"generationConfig\":{\"maxOutputTokens\":120}}";
  const size_t pcmBytes = recordedSampleCount * sizeof(int16_t);
  const size_t wavBytes = 44 + pcmBytes;
  const size_t wavBase64Bytes = ((wavBytes + 2) / 3) * 4;
  const size_t contentLength =
      strlen(payloadPrefix) + wavBase64Bytes + strlen(payloadSuffix);
  const String path = String(F("/v1beta/models/")) + GEMINI_TEXT_MODEL +
                      F(":generateContent");

  client.print(F("POST "));
  client.print(path);
  client.print(F(" HTTP/1.1\r\nHost: generativelanguage.googleapis.com\r\n"));
  client.print(F("Content-Type: application/json\r\nx-goog-api-key: "));
  client.print(GEMINI_API_KEY);
  client.print(F("\r\nContent-Length: "));
  client.print(contentLength);
  client.print(F("\r\nConnection: close\r\n\r\n"));

  uint8_t wavHeader[44];
  buildWavHeader(wavHeader);

  uint8_t carry[3];
  size_t carryLength = 0;
  if (!writeAll(client, payloadPrefix)) {
    Serial.println("Gemini stream failed while writing JSON prefix");
    client.stop();
    return String();
  }
  if (!writeBase64StreamChunk(client,
                              wavHeader,
                              sizeof(wavHeader),
                              carry,
                              carryLength)) {
    Serial.println("Gemini stream failed while writing WAV header");
    client.stop();
    return String();
  }
  if (!writeBase64StreamChunk(client,
                              reinterpret_cast<const uint8_t *>(recordingBuffer),
                              pcmBytes,
                              carry,
                              carryLength)) {
    Serial.println("Gemini stream failed while writing recorded PCM");
    client.stop();
    return String();
  }
  if (!finishBase64Stream(client, carry, carryLength)) {
    Serial.println("Gemini stream failed while finishing base64");
    client.stop();
    return String();
  }
  if (!writeAll(client, payloadSuffix)) {
    Serial.println("Gemini stream failed while writing JSON suffix");
    client.stop();
    return String();
  }

  int status = 0;
  String response;
  if (!readHttpBody(client, status, response)) {
    Serial.println("Could not read Gemini text response");
    client.stop();
    return String();
  }
  client.stop();

  if (status < 200 || status >= 300) {
    Serial.printf("Gemini text HTTP %d\n", status);
    Serial.println(response);
    return String();
  }

  String text;
  if (!extractJsonStringAfter(response, nullptr, "\"text\"", text)) {
    Serial.println("Could not parse Gemini text response");
    Serial.println(response);
    return String();
  }

  text.trim();
  Serial.println("Gemini response:");
  Serial.println(text);
  return text;
}

bool geminiTextToSpeech(const String &text) {
  String payload;
  payload.reserve(text.length() + 512);
  payload += F("{\"contents\":[{\"parts\":[{\"text\":\"Say clearly and conversationally: ");
  payload += jsonEscape(text);
  payload += F("\"}]}],\"generationConfig\":{\"responseModalities\":[\"AUDIO\"],");
  payload += F("\"speechConfig\":{\"voiceConfig\":{\"prebuiltVoiceConfig\":{\"voiceName\":\"");
  payload += GEMINI_TTS_VOICE;
  payload += F("\"}}}},\"model\":\"");
  payload += GEMINI_TTS_MODEL;
  payload += F("\"}");

  int status = 0;
  String audioMimeType;
  bool receivedAudio = false;
  const String path = String(F("/v1beta/models/")) + GEMINI_TTS_MODEL +
                      F(":generateContent");

  for (uint8_t attempt = 1; attempt <= GEMINI_TTS_MAX_ATTEMPTS; ++attempt) {
    WiFiClientSecure client;
    client.setInsecure();
    client.setTimeout(60000);

    if (!client.connect("generativelanguage.googleapis.com", 443)) {
      Serial.println("Could not connect to Gemini TTS");
      client.stop();
      if (attempt < GEMINI_TTS_MAX_ATTEMPTS) {
        delay(500 * attempt);
        continue;
      }
      freeTtsAudio();
      return false;
    }

    client.print(F("POST "));
    client.print(path);
    client.print(F(" HTTP/1.1\r\nHost: generativelanguage.googleapis.com\r\n"));
    client.print(F("Content-Type: application/json\r\nx-goog-api-key: "));
    client.print(GEMINI_API_KEY);
    client.print(F("\r\nContent-Length: "));
    client.print(payload.length());
    client.print(F("\r\nConnection: close\r\n\r\n"));
    client.print(payload);

    receivedAudio = readGeminiTtsAudioResponse(client, status, audioMimeType);
    client.stop();

    if (receivedAudio) {
      break;
    }

    freeTtsAudio();
    if (status < 500 || status >= 600 || attempt >= GEMINI_TTS_MAX_ATTEMPTS) {
      return false;
    }

