smitamw/esp32s3-assistant/ai_assistant_esp32s3/ai_assistant_esp32s3.ino
    Serial.printf("Retrying Gemini TTS after HTTP %d, attempt %u of %u\n",
                  status,
                  static_cast<unsigned>(attempt + 1),
                  static_cast<unsigned>(GEMINI_TTS_MAX_ATTEMPTS));
    delay(750 * attempt);
  }

  if (!receivedAudio) {
    return false;
  }

  if (!audioMimeType.isEmpty()) {
    Serial.println("TTS MIME type:");
    Serial.println(audioMimeType);
  }

  const size_t decodedLength = ttsPcmBytes;
  size_t pcmBytes = decodedLength;
  uint32_t pcmSampleRate = sampleRateFromMimeType(audioMimeType,
                                                  TTS_SAMPLE_RATE);
  printTtsHeaderBytes();
  const bool ttsLooksLikeWav = ttsStartsWithRiffWave();

  if (ttsLooksLikeWav) {
    if (!normalizeTtsWavInPlace(pcmSampleRate)) {
      freeTtsAudio();
      return false;
    }
    pcmBytes = ttsPcmBytes;
  } else if (!isRawPcmMimeType(audioMimeType)) {
    Serial.println("TTS audio MIME type is not recognized as raw PCM");
    freeTtsAudio();
    return false;
  } else {
    Serial.printf("TTS audio is raw 16-bit little-endian PCM: %u bytes\n",
                  static_cast<unsigned>(decodedLength));
  }

  if (pcmBytes % sizeof(int16_t) != 0) {
    --pcmBytes;
  }

  if (pcmBytes == 0) {
    Serial.println("TTS audio did not contain playable 16-bit PCM");
    freeTtsAudio();
    return false;
  }
  if (pcmSampleRate == 0) {
    Serial.println("TTS audio did not provide a valid sample rate");
    freeTtsAudio();
    return false;
  }

  ttsPlaybackSampleRate = pcmSampleRate;
  ttsPcmBytes = pcmBytes;
  printTtsPcmStats();
  Serial.printf("TTS playback: %u bytes, %u samples, %lu Hz, %lu ms\n",
                static_cast<unsigned>(ttsPcmBytes),
                static_cast<unsigned>(ttsPcmBytes / sizeof(int16_t)),
                static_cast<unsigned long>(ttsPlaybackSampleRate),
                static_cast<unsigned long>(
                    ((ttsPcmBytes / sizeof(int16_t)) * 1000UL) /
                    ttsPlaybackSampleRate));
  return ttsPcmBytes > 0;
}

bool geminiTtsStreamToSpeaker(const String &text) {
  String payload;
  payload.reserve(text.length() + 512);
  payload += F("{\"contents\":[{\"parts\":[{\"text\":\"Say clearly and conversationally: ");
  payload += jsonEscape(text);
  payload += F("\"}]}],\"generationConfig\":{\"responseModalities\":[\"AUDIO\"],");
  payload += F("\"speechConfig\":{\"voiceConfig\":{\"prebuiltVoiceConfig\":{\"voiceName\":\"");
  payload += GEMINI_TTS_VOICE;
  payload += F("\"}}}},\"model\":\"");
  payload += GEMINI_TTS_MODEL;
  payload += F("\"}");

  const String reqPath = String(F("/v1beta/models/")) + GEMINI_TTS_MODEL +
                         F(":generateContent");
  int status = 0;
  bool succeeded = false;

  for (uint8_t attempt = 1; attempt <= GEMINI_TTS_MAX_ATTEMPTS; ++attempt) {
    WiFiClientSecure client;
    client.setInsecure();
    client.setTimeout(60000);

    if (!client.connect("generativelanguage.googleapis.com", 443)) {
      Serial.println("Could not connect to Gemini TTS (streaming)");
      client.stop();
      if (attempt < GEMINI_TTS_MAX_ATTEMPTS) {
        delay(500 * attempt);
        continue;
      }
      return false;
    }

    client.print(F("POST "));
    client.print(reqPath);
    client.print(F(" HTTP/1.1\r\nHost: generativelanguage.googleapis.com\r\n"));
    client.print(F("Content-Type: application/json\r\nx-goog-api-key: "));
    client.print(GEMINI_API_KEY);
    client.print(F("\r\nContent-Length: "));
    client.print(payload.length());
    client.print(F("\r\nConnection: close\r\n\r\n"));
    client.print(payload);

    bool chunked = false;
    int contentLength = -1;
    if (!readHttpHeaders(client, status, chunked, contentLength)) {
      client.stop();
      if (attempt < GEMINI_TTS_MAX_ATTEMPTS) {
        delay(500 * attempt);
        continue;
      }
      return false;
    }

    if (status < 200 || status >= 300) {
      String errorBody;
      errorBody.reserve(min(contentLength > 0 ? contentLength : 1024, 1024));
      HttpBodyReader errReader = {&client, chunked, contentLength, 0, 0, false};
      char ec;
      while (readHttpBodyByte(errReader, ec) &&
             errorBody.length() < 1024) {
        errorBody += ec;
      }
      Serial.printf("Gemini TTS HTTP %d (streaming)\n", status);
      Serial.println(errorBody);
      client.stop();
      if (status >= 500 && status < 600 &&
          attempt < GEMINI_TTS_MAX_ATTEMPTS) {
        Serial.printf("Retrying streaming TTS, attempt %u of %u\n",
                      static_cast<unsigned>(attempt + 1),
                      static_cast<unsigned>(GEMINI_TTS_MAX_ATTEMPTS));
        delay(750 * attempt);
        continue;
      }
      return false;
    }

    HttpBodyReader reader = {&client, chunked, contentLength, 0, 0, false};

    enum class ParseState {
      Searching,
      SeekMimeColon,
      SeekMimeQuote,
      ReadMime,
      SeekDataColon,
      SeekDataQuote,
      ReadData,
      Done,
    };

    ParseState ps = ParseState::Searching;
    String tail;
    tail.reserve(48);
    bool sawInlineData = false;
    bool jsonEsc = false;
    String audioMimeType;
    char quartet[4];
    size_t quartetLen = 0;

    constexpr size_t WAV_HDR_MAX = 128;
    uint8_t wavHdr[WAV_HDR_MAX];
    size_t wavHdrUsed = 0;
    bool fmtKnown = false;
    bool spkStarted = false;
    uint32_t spkRate = TTS_SAMPLE_RATE;
    uint16_t spkChannels = 1;
    size_t pcmStart = 0;
    size_t totalDec = 0;

    uint8_t frameBuf[4];
    size_t frameBufUsed = 0;
    size_t frameBufNeed = 2;
    size_t i2sSamples = 0;
    bool interrupted = false;
    bool parseOk = true;

    char ch;
    while (parseOk && !interrupted && readHttpBodyByte(reader, ch)) {
      switch (ps) {
        case ParseState::Searching:
          tail += ch;
          if (tail.length() > 48) {
            tail.remove(0, tail.length() - 48);
          }
          if (tail.endsWith("\"inlineData\"") ||
              tail.endsWith("\"inline_data\"")) {
            sawInlineData = true;
          } else if (sawInlineData &&
                     (tail.endsWith("\"mimeType\"") ||
                      tail.endsWith("\"mime_type\""))) {
            ps = ParseState::SeekMimeColon;
          } else if ((sawInlineData && tail.endsWith("\"data\"")) ||
                     tail.endsWith("\"audioContent\"") ||
                     tail.endsWith("\"audio_content\"")) {
            ps = ParseState::SeekDataColon;
          }
          break;

        case ParseState::SeekMimeColon:
          if (ch == ':') {
            ps = ParseState::SeekMimeQuote;
          }
          break;

