smitamw/esp32s3-assistant/ai_assistant_esp32s3/ai_assistant_esp32s3.ino
        case ParseState::SeekMimeQuote:
          if (ch == '"') {
            audioMimeType = "";
            jsonEsc = false;
            ps = ParseState::ReadMime;
          }
          break;

        case ParseState::ReadMime:
          if (jsonEsc) {
            audioMimeType += ch;
            jsonEsc = false;
          } else if (ch == '\\') {
            jsonEsc = true;
          } else if (ch == '"') {
            ps = ParseState::Searching;
            tail = "";
          } else {
            audioMimeType += ch;
          }
          break;

        case ParseState::SeekDataColon:
          if (ch == ':') {
            ps = ParseState::SeekDataQuote;
          }
          break;

        case ParseState::SeekDataQuote:
          if (ch == '"') {
            jsonEsc = false;
            quartetLen = 0;
            ps = ParseState::ReadData;
          }
          break;

        case ParseState::ReadData: {
          char b64c = 0;
          bool haveB64 = false;
          if (jsonEsc) {
            b64c = ch;
            haveB64 = true;
            jsonEsc = false;
          } else if (ch == '\\') {
            jsonEsc = true;
          } else if (ch == '"') {
            if (quartetLen != 0) {
              Serial.println("Streaming TTS: partial base64 at end");
              parseOk = false;
            }
            ps = ParseState::Done;
          } else if (ch != '\n' && ch != '\r' && ch != '\t' && ch != ' ') {
            b64c = ch;
            haveB64 = true;
          }

          if (haveB64) {
            quartet[quartetLen++] = b64c;
            if (quartetLen == 4) {
              uint8_t decoded[3];
              size_t decLen = 0;
              if (mbedtls_base64_decode(
                      decoded,
                      sizeof(decoded),
                      &decLen,
                      reinterpret_cast<const unsigned char *>(quartet),
                      4) != 0) {
                Serial.println("Streaming TTS: base64 decode error");
                parseOk = false;
                break;
              }
              quartetLen = 0;

              for (size_t di = 0; di < decLen && parseOk && !interrupted;
                   ++di) {
                const uint8_t b = decoded[di];
                const size_t pos = totalDec++;

                if (!fmtKnown) {
                  if (wavHdrUsed < WAV_HDR_MAX) {
                    wavHdr[wavHdrUsed++] = b;
                  }
                  if (wavHdrUsed < 12) {
                    continue;
                  }

                  const bool isWav =
                      memcmp(wavHdr, "RIFF", 4) == 0 &&
                      memcmp(wavHdr + 8, "WAVE", 4) == 0;

                  if (!isWav && wavHdrUsed >= 44) {
                    fmtKnown = true;
                    pcmStart = 0;
                    spkRate = sampleRateFromMimeType(audioMimeType,
                                                    TTS_SAMPLE_RATE);
                    spkChannels = 1;
                    frameBufNeed = 2;
                    Serial.printf("Streaming raw PCM: %lu Hz\n",
                                  static_cast<unsigned long>(spkRate));

                    if (!setupSpeakerI2S(spkRate)) {
                      Serial.println("I2S setup failed (streaming)");
                      parseOk = false;
                      break;
                    }
                    digitalWrite(AMP_SD_PIN, HIGH);
                    delay(5);
                    i2s_zero_dma_buffer(I2S_NUM_0);
                    spkStarted = true;

                    for (size_t hi = 0; hi < wavHdrUsed; ++hi) {
                      frameBuf[frameBufUsed++] = wavHdr[hi];
                      if (frameBufUsed >= frameBufNeed) {
                        frameBufUsed = 0;
                        const int16_t s = static_cast<int16_t>(
                            static_cast<uint16_t>(frameBuf[0]) |
                            (static_cast<uint16_t>(frameBuf[1]) << 8));
                        const int16_t gs = applyPlaybackGain(s);
                        i2sOutputBuffer[i2sSamples * 2] = gs;
                        i2sOutputBuffer[i2sSamples * 2 + 1] = gs;
                        if (++i2sSamples >= MONO_SAMPLES_PER_CHUNK) {
                          writeSpeakerSamples(i2sOutputBuffer, i2sSamples);
                          i2sSamples = 0;
                        }
                      }
                    }
                    continue;
                  }

                  if (isWav) {
                    bool foundFmt = false;
                    bool foundData = false;
                    uint16_t audioFmt = 0;
                    uint16_t bps = 0;
                    size_t scanOff = 12;

                    while (scanOff + 8 <= wavHdrUsed) {
                      const uint32_t chunkSz =
                          readLittleEndian32(wavHdr + scanOff + 4);
                      const size_t chunkDataOff = scanOff + 8;

                      if (memcmp(wavHdr + scanOff, "fmt ", 4) == 0 &&
                          chunkDataOff + 16 <= wavHdrUsed && chunkSz >= 16) {
                        audioFmt = readLittleEndian16(wavHdr + chunkDataOff);
                        spkChannels =
                            readLittleEndian16(wavHdr + chunkDataOff + 2);
                        spkRate =
                            readLittleEndian32(wavHdr + chunkDataOff + 4);
                        bps = readLittleEndian16(wavHdr + chunkDataOff + 14);
                        foundFmt = true;
                      } else if (memcmp(wavHdr + scanOff, "data", 4) == 0) {
                        pcmStart = chunkDataOff;
                        foundData = true;
                        break;
                      }

                      const size_t nextOff =
                          chunkDataOff + chunkSz + (chunkSz % 2);
                      if (nextOff <= scanOff || nextOff > wavHdrUsed) {
                        break;
                      }
                      scanOff = nextOff;
                    }

                    if (!foundFmt || !foundData) {
                      if (wavHdrUsed >= WAV_HDR_MAX) {
                        Serial.println("WAV header too large for streaming");
                        parseOk = false;
                        break;
                      }
                      continue;
                    }

                    if (audioFmt != 1 || bps != 16) {
                      Serial.printf(
                          "Streaming TTS: unsupported WAV fmt=%u bps=%u\n",
                          audioFmt,
                          bps);
                      parseOk = false;
                      break;
                    }
                    if (spkChannels != 1 && spkChannels != 2) {
                      Serial.printf(
                          "Streaming TTS: unsupported channels=%u\n",
                          spkChannels);
                      parseOk = false;
                      break;
                    }

                    fmtKnown = true;
                    frameBufNeed = spkChannels * sizeof(int16_t);
                    Serial.printf("Streaming WAV: %lu Hz, %u ch, PCM@%u\n",
                                  static_cast<unsigned long>(spkRate),
                                  spkChannels,
                                  static_cast<unsigned>(pcmStart));

                    if (!setupSpeakerI2S(spkRate)) {
                      Serial.println("I2S setup failed (streaming WAV)");
                      parseOk = false;
                      break;
                    }
                    digitalWrite(AMP_SD_PIN, HIGH);
                    delay(5);
                    i2s_zero_dma_buffer(I2S_NUM_0);
                    spkStarted = true;

                    for (size_t hi = pcmStart; hi < wavHdrUsed; ++hi) {
                      frameBuf[frameBufUsed++] = wavHdr[hi];
                      if (frameBufUsed >= frameBufNeed) {
                        frameBufUsed = 0;
                        int16_t s;
                        if (spkChannels == 2) {
                          const int16_t l = static_cast<int16_t>(
                              static_cast<uint16_t>(frameBuf[0]) |
                              (static_cast<uint16_t>(frameBuf[1]) << 8));
                          const int16_t r = static_cast<int16_t>(
                              static_cast<uint16_t>(frameBuf[2]) |
                              (static_cast<uint16_t>(frameBuf[3]) << 8));
                          s = static_cast<int16_t>(
                              (static_cast<int32_t>(l) + r) / 2);
                        } else {
                          s = static_cast<int16_t>(
                              static_cast<uint16_t>(frameBuf[0]) |
                              (static_cast<uint16_t>(frameBuf[1]) << 8));
                        }
                        const int16_t gs = applyPlaybackGain(s);
                        i2sOutputBuffer[i2sSamples * 2] = gs;
                        i2sOutputBuffer[i2sSamples * 2 + 1] = gs;
                        if (++i2sSamples >= MONO_SAMPLES_PER_CHUNK) {
                          writeSpeakerSamples(i2sOutputBuffer, i2sSamples);
                          i2sSamples = 0;
                        }
                      }
                    }
                    continue;
                  }

                  continue;
                }

                if (pos < pcmStart) {
                  continue;
                }

                frameBuf[frameBufUsed++] = b;
                if (frameBufUsed < frameBufNeed) {
                  continue;
                }
                frameBufUsed = 0;

                int16_t sample;
                if (spkChannels == 2) {
                  const int16_t l = static_cast<int16_t>(
                      static_cast<uint16_t>(frameBuf[0]) |
                      (static_cast<uint16_t>(frameBuf[1]) << 8));
                  const int16_t r = static_cast<int16_t>(
                      static_cast<uint16_t>(frameBuf[2]) |
                      (static_cast<uint16_t>(frameBuf[3]) << 8));
                  sample = static_cast<int16_t>(
                      (static_cast<int32_t>(l) + r) / 2);
                } else {
                  sample = static_cast<int16_t>(
                      static_cast<uint16_t>(frameBuf[0]) |
                      (static_cast<uint16_t>(frameBuf[1]) << 8));
                }

                const int16_t gained = applyPlaybackGain(sample);
                i2sOutputBuffer[i2sSamples * 2] = gained;
                i2sOutputBuffer[i2sSamples * 2 + 1] = gained;
                if (++i2sSamples >= MONO_SAMPLES_PER_CHUNK) {
                  writeSpeakerSamples(i2sOutputBuffer, i2sSamples);
                  i2sSamples = 0;
                  if (digitalRead(BUTTON_INPUT_PIN) == LOW) {
                    interrupted = true;
                  }
                }
              }
            }
          }
          break;
        }

        case ParseState::Done:
          break;
      }

