smitamw/esp32s3-assistant/ai_assistant_esp32s3/ai_assistant_esp32s3.ino
      if (ps == ParseState::Done) {
        break;
      }
    }

    if (i2sSamples > 0) {
      writeSpeakerSamples(i2sOutputBuffer, i2sSamples);
      i2sSamples = 0;
    }

    client.stop();

    if (spkStarted) {
      delay(50);
      digitalWrite(AMP_SD_PIN, LOW);
    }

    if (interrupted) {
      Serial.println("Streaming TTS interrupted by button");
      succeeded = true;
      break;
    }

    if (parseOk && ps == ParseState::Done) {
      Serial.printf("Streamed TTS: %u bytes decoded, %lu Hz\n",
                    static_cast<unsigned>(totalDec),
                    static_cast<unsigned long>(spkRate));
      succeeded = true;
      break;
    }

    Serial.println("Streaming TTS: audio not fully received");
    Serial.printf("Bytes read: %u, decoded: %u\n",
                  static_cast<unsigned>(reader.bytesRead),
                  static_cast<unsigned>(totalDec));

    if (attempt < GEMINI_TTS_MAX_ATTEMPTS) {
      Serial.printf("Retrying streaming TTS, attempt %u of %u\n",
                    static_cast<unsigned>(attempt + 1),
                    static_cast<unsigned>(GEMINI_TTS_MAX_ATTEMPTS));
      delay(750 * attempt);
    }
  }

  return succeeded;
}

void processAssistantRequest() {
  audioMode = AudioMode::Thinking;
  digitalWrite(AMP_SD_PIN, LOW);
  uninstallI2S();

  if (recordedSampleCount == 0) {
    showStatus(F("No recording"));
    delay(1000);
    enterMicrophoneMode(true);
    return;
  }

  printClipStats();
  showStatus(F("Thinking"), F("Sending to Gemini"));
  startThinkingAnimation();

  bool ok = connectWifi();
  String replyText;

  if (ok) {
    replyText = geminiGenerateText();
    ok = !replyText.isEmpty();
  }

  if (ok) {
    freeRecordingBuffer();
    showStatus(F("Thinking"), F("Making speech"));
    stopThinkingAnimation();
    setNeoPixel(0, 255, 0);
    ok = geminiTtsStreamToSpeaker(replyText);
  }

  stopThinkingAnimation();

  if (!ok) {
    setNeoPixel(255, 0, 0);
    showStatus(F("Gemini failed"), F("See Serial log"));
    delay(2000);
  }

  enterMicrophoneMode(true);
}

void handleButton() {
  const bool reading = digitalRead(BUTTON_INPUT_PIN);
  const uint32_t now = millis();

  if (reading != lastButtonReading) {
    lastButtonChangeMs = now;
    lastButtonReading = reading;
  }

  if ((now - lastButtonChangeMs) < BUTTON_DEBOUNCE_MS ||
      reading == stableButtonReading) {
    return;
  }

  stableButtonReading = reading;
  if (stableButtonReading != LOW) {
    return;
  }

  if (audioMode == AudioMode::Microphone) {
    processAssistantRequest();
  } else if (audioMode == AudioMode::Speaker) {
    enterMicrophoneMode(true);
  }
}

int16_t applyPlaybackGain(int16_t sample) {
  const int32_t amplifiedSample = static_cast<int32_t>(sample) * PLAYBACK_GAIN;
  return constrain(amplifiedSample, -32768, 32767);
}

int16_t decodeMicSample(int32_t rawSample) {
  return static_cast<int16_t>(rawSample >> MIC_SAMPLE_SHIFT);
}

int16_t chooseMicSample(int32_t leftSample, int32_t rightSample) {
  const int16_t left = decodeMicSample(leftSample);
  const int16_t right = decodeMicSample(rightSample);

  if (abs(static_cast<int32_t>(right)) > abs(static_cast<int32_t>(left))) {
    return right;
  }

  return left;
}

void writeSpeakerSamples(const int16_t *samples, size_t samplesThisChunk) {
  size_t bytesWritten = 0;
  const size_t bytesToWrite = samplesThisChunk * 2 * sizeof(int16_t);
  const esp_err_t err = i2s_write(I2S_NUM_0,
                                  samples,
                                  bytesToWrite,
                                  &bytesWritten,
                                  portMAX_DELAY);

  if (err != ESP_OK || bytesWritten != bytesToWrite) {
    Serial.printf("I2S write failed/short: err=%d %u of %u bytes\n",
                  err,
                  static_cast<unsigned>(bytesWritten),
                  static_cast<unsigned>(bytesToWrite));
  }
}

void playTestTone(uint32_t sampleRate) {
  const uint32_t totalSamples =
      (sampleRate * static_cast<uint32_t>(TEST_TONE_MS)) / 1000;
  const uint32_t halfPeriodSamples =
      max(1UL, sampleRate / (TEST_TONE_HZ * 2UL));
  uint32_t samplesWritten = 0;

  while (samplesWritten < totalSamples) {
    const size_t samplesThisChunk =
        min(static_cast<size_t>(MONO_SAMPLES_PER_CHUNK),
            static_cast<size_t>(totalSamples - samplesWritten));

    for (size_t i = 0; i < samplesThisChunk; ++i) {
      const bool highHalf =
          ((samplesWritten + i) / halfPeriodSamples) % 2 == 0;
      const int16_t sample =
          highHalf ? TEST_TONE_AMPLITUDE : -TEST_TONE_AMPLITUDE;
      i2sOutputBuffer[i * 2] = sample;
      i2sOutputBuffer[i * 2 + 1] = sample;
    }

    writeSpeakerSamples(i2sOutputBuffer, samplesThisChunk);
    samplesWritten += samplesThisChunk;
  }
}

void printClipStats() {
  if (recordedSampleCount == 0) {
    return;
  }

  int16_t minSample = 32767;
  int16_t maxSample = -32768;
  uint64_t levelSum = 0;

  for (size_t i = 0; i < recordedSampleCount; ++i) {
    const int16_t sample = recordingBuffer[i];
    minSample = min(minSample, sample);
    maxSample = max(maxSample, sample);
    levelSum += abs(static_cast<int32_t>(sample));
  }

  Serial.printf("Clip stats: min=%d max=%d avg_abs=%lu\n",
                minSample,
                maxSample,
                static_cast<unsigned long>(levelSum / recordedSampleCount));
}

void printMicRawDebug(size_t stereoSamplesRead) {
  if (!PRINT_MIC_RAW_DEBUG || stereoSamplesRead < 2 ||
      millis() - lastMicDebugMs < MIC_DEBUG_INTERVAL_MS) {
    return;
  }

  lastMicDebugMs = millis();

  int32_t minLeft = INT32_MAX;
  int32_t maxLeft = INT32_MIN;
  int32_t minRight = INT32_MAX;
  int32_t maxRight = INT32_MIN;
  size_t nonZeroLeft = 0;
  size_t nonZeroRight = 0;
  const size_t frames = stereoSamplesRead / 2;

  for (size_t i = 0; i < frames; ++i) {
    const int32_t left = i2sInputBuffer[i * 2];
    const int32_t right = i2sInputBuffer[i * 2 + 1];
    minLeft = min(minLeft, left);
    maxLeft = max(maxLeft, left);
    minRight = min(minRight, right);
    maxRight = max(maxRight, right);

    if (left != 0) {
      ++nonZeroLeft;
    }
    if (right != 0) {
      ++nonZeroRight;
    }
  }

  Serial.printf(
      "Mic raw: frames=%u Lnz=%u Rnz=%u Lmin=%ld Lmax=%ld Rmin=%ld Rmax=%ld first=%08lX,%08lX,%08lX,%08lX\n",
      static_cast<unsigned>(frames),
      static_cast<unsigned>(nonZeroLeft),
      static_cast<unsigned>(nonZeroRight),
      static_cast<long>(minLeft),
      static_cast<long>(maxLeft),
      static_cast<long>(minRight),
      static_cast<long>(maxRight),
      static_cast<unsigned long>(i2sInputBuffer[0]),
      static_cast<unsigned long>(i2sInputBuffer[1]),
      static_cast<unsigned long>(i2sInputBuffer[2]),
      static_cast<unsigned long>(i2sInputBuffer[3]));
}

