smitamw/esp32s3-assistant/ai_assistant_esp32s3/ai_assistant_esp32s3.ino
void recordMicrophoneChunk() {
  size_t bytesRead = 0;
  const esp_err_t err = i2s_read(I2S_NUM_0,
                                 i2sInputBuffer,
                                 sizeof(i2sInputBuffer),
                                 &bytesRead,
                                 pdMS_TO_TICKS(100));
  if (err != ESP_OK || bytesRead == 0) {
    return;
  }

  const size_t stereoSamplesRead = bytesRead / sizeof(int32_t);
  const size_t monoSamplesRead = stereoSamplesRead / 2;
  printMicRawDebug(stereoSamplesRead);

  for (size_t i = 0; i < monoSamplesRead; ++i) {
    const int16_t sample =
        chooseMicSample(i2sInputBuffer[i * 2], i2sInputBuffer[i * 2 + 1]);

    if (recordedSampleCount < MAX_RECORDING_SAMPLES) {
      recordingBuffer[recordedSampleCount++] = sample;
    }
  }
}

void playSpeakerChunk() {
  if (ttsPcmHead == nullptr || playbackCursor >= ttsPcmBytes) {
    digitalWrite(AMP_SD_PIN, LOW);
    enterMicrophoneMode(true);
    return;
  }

  const size_t remainingSamples = (ttsPcmBytes - playbackCursor) / sizeof(int16_t);
  const size_t samplesThisChunk =
      min(static_cast<size_t>(MONO_SAMPLES_PER_CHUNK), remainingSamples);

  size_t samplesReady = 0;
  for (size_t i = 0; i < samplesThisChunk; ++i) {
    int16_t rawSample = 0;
    if (!readPlaybackSample(rawSample)) {
      ttsPcmBytes = playbackCursor;
      break;
    }
    const int16_t sample = applyPlaybackGain(rawSample);
    i2sOutputBuffer[i * 2] = sample;
    i2sOutputBuffer[i * 2 + 1] = sample;
    ++samplesReady;
  }

  if (samplesReady > 0) {
    writeSpeakerSamples(i2sOutputBuffer, samplesReady);
  }
}

void setup() {
  Serial.begin(115200);
  delay(200);

  pinMode(AMP_SD_PIN, OUTPUT);
  digitalWrite(AMP_SD_PIN, LOW);

  pinMode(NEOPIXEL_PIN, OUTPUT);
  setNeoPixel(0, 0, 0);

  pinMode(BUTTON_GROUND_PIN, OUTPUT);
  digitalWrite(BUTTON_GROUND_PIN, LOW);
  pinMode(BUTTON_INPUT_PIN, INPUT_PULLUP);

  if (!allocateRecordingBuffer()) {
    setNeoPixel(0, 0, 0);
    return;
  }

  if (PLAY_TEST_TONE_ON_BOOT && setupSpeakerI2S(AUDIO_SAMPLE_RATE)) {
    Serial.println("Playing boot speaker test tone");
    digitalWrite(AMP_SD_PIN, HIGH);
    delay(5);
    playTestTone(AUDIO_SAMPLE_RATE);
    digitalWrite(AMP_SD_PIN, LOW);
    delay(50);
  }

  enterMicrophoneMode(true);

  Serial.printf("Recording up to %u seconds at %lu Hz\n",
                MAX_RECORDING_SECONDS,
                static_cast<unsigned long>(AUDIO_SAMPLE_RATE));
}

void loop() {
  handleButton();

  if (audioMode == AudioMode::Microphone) {
    if (recordingBuffer == nullptr && !allocateRecordingBuffer()) {
      delay(1000);
      return;
    }
    if (!i2sReady) {
      setupMicrophoneI2S();
    }
    recordMicrophoneChunk();
  } else if (audioMode == AudioMode::Speaker) {
    if (!i2sReady) {
      enterMicrophoneMode(true);
      return;
    }
    playSpeakerChunk();
  } else {
    delay(10);
  }
}
